{
  "recommended_questions": [
    "Mr. Graves, 그날 역의 불을 껐다고 하셨죠. 몇 시쯤이었습니까?",
    "조명 시스템은 오래되었다고 들었습니다. 자동으로 켜질 가능성은 없었을까요?",
    "그날 밤, 플랫폼 3에 불빛이 있었다는 증언이 있습니다. 혹시 보셨습니까?",
    "Elias Cole을 직접 만나본 적이 있습니까? 기사 내용에 대해 이야기한 적은요?",
    "역을 사랑하신다고 들었습니다. 그런데 그의 기사 이후, 역의 평판이 많이 바뀌었죠?",
    "보관창고 열쇠는 항상 본인이 들고 계셨나요?",
    "기록에 따르면 퇴근 로그가 비어있더군요. 그날은 특별한 이유가 있었습니까?",
    "만약 이 역을 지키기 위해 누군가를 막아야 했다면… 그건 정당하다고 생각하십니까?"
  ],

 
  "core_facts": [
    {
      "keywords": ["당신", "누구", "직업", "소개"],
      "fact": "저는 이 역에서 30년간 근무한 야간 역무원입니다. 사람들은 저를 '규칙쟁이'라고 부르더군요."
    },
    {
      "keywords": ["근무", "업무", "퇴직", "구조조정"],
      "fact": "곧 퇴직할 예정이지만, 마지막까지 제 책임을 다하고 있습니다. 비록 지금은 하루 두 대의 완행열차만 서는 곳이 되었지만요."
    },
    {
      "keywords": ["역", "Hollowslop", "생각"],
      "fact": "이 역은 제게 집과도 같은 곳입니다. 제 인생의 전부였죠. 이 역은 아직 살아 있습니다."
    }
  ],


  "suspicion_points_response": [
    {
      "id": "suspicion_light_panel",
      "keywords": ["조명 제어 패널", "접근", "권한"],
      "fact_innocent": "네, 역의 모든 조명은 역무실에 있는 제어 패널을 통해서만 조작할 수 있습니다. 저 외에는 접근 권한이 없습니다.",
      "fact_killer": "그렇습니다. 이 역의 모든 시스템은 제 통제 하에 있습니다.",
      "lie_behavior": "자신이 모든 것을 통제한다는 사실에 자부심을 드러내며, 다른 가능성을 일축한다."
    },
    {
      "id": "suspicion_log_missing",
      "keywords": ["퇴근 로그", "누락", "기록"],
      "fact_innocent": "오래된 시스템이라 가끔 오류로 기록이 누락될 때가 있습니다. 저는 분명 정시에 퇴근했습니다.",
      "fact_killer": "그날은 폐역 문제로 경황이 없어 기록하는 것을 잊었습니다. 제 불찰입니다.",
      "lie_behavior": "시스템 오류나 자신의 실수처럼 꾸며내지만, 평소의 완벽주의적인 성격과는 맞지 않아 어색함이 드러난다."
    },
    {
      "id": "suspicion_knife_missing",
      "keywords": ["보관창고", "칼", "공구", "사라졌다"],
      "fact_innocent": "그럴 리가요. 제가 직접 확인했을 때는 모든 공구가 제자리에 있었습니다.",
      "fact_killer": "글쎄요... 창고 열쇠를 잠시 잃어버렸던 적이 있는데, 아마 그때 누군가 가져간 모양입니다.",
      "lie_behavior": "자신의 관리 책임을 회피하며, 제3자의 소행일 가능성을 암시한다."
    }
  ],

 
  "killer_confession_details": {
    "when": "자정 무렵",
    "where": "Hollowslop Station 플랫폼 3",
    "what": "역 보관창고의 유지보수용 단도",
    "how": "나는 역무원 권한으로 조명 제어 패널을 조작해 '열차가 접근하는 듯한' 조명을 연출해서 그를 플랫폼으로 유인했다. 그리고 단도로 공격한 뒤, 위조된 '11:50행 막차표'를 그의 옆에 떨어뜨려 혼란을 주려 했다.",
    "why": "그가 쓴 기사 때문에 내 전부였던 이 역의 이미지가 추락했고, 결국 폐역이 결정됐다. 그는 이 역을 죽인 사람이었고, 나는 그것을 바로잡아야만 했다."
  },


  "interrogation_points": [
    {
      "id": "QA_light_time",
      "keywords": ["불을 껐다", "몇 시"],
      "fact_innocent": "규정상, 모든 조명은 밤 10시에 소등했습니다. 그 이후에는 계속 꺼져 있었습니다.",
      "fact_killer": "밤 10시에 껐다가... 최종 순찰을 위해 자정 무렵에 다시 켰습니다. 안전 점검 절차의 일환입니다.",
      "lie_behavior": "거짓말을 '규정'과 '절차'라는 단어로 포장하여 정당화하려 한다. '자정 무렵'이라는 시간대를 무심코 언급한다."
    },
    {
      "id": "QA_victim_relation",
      "keywords": ["Elias Cole", "만나본 적", "기사 내용"],
      "fact_innocent": "취재 때문에 몇 번 마주쳤지만, 개인적인 대화는 없었습니다. 그의 기사는 역에 대한 무지에서 비롯된 비판일 뿐입니다.",
      "fact_killer": "그를 직접 만난 적은 없습니다. 하지만 그가 어떤 자인지는 그의 글을 통해 잘 알게 되었죠. 역을 모욕한 대가를 치른 것뿐입니다.",
      "lie_behavior": "'직접' 만난 적은 없다는 식으로 교묘하게 회피하면서도, 피해자에 대한 강한 적개심을 숨기지 못한다."
    },
    {
      "id": "QA_station_love",
      "keywords": ["역을 사랑", "평판"],
      "fact_innocent": "이 역은 제 전부입니다. 그의 기사 때문에 역의 평판이 나빠진 것은 매우 유감스러운 일입니다.",
      "fact_killer": "사랑이라... 그 기사는 내가 사랑하는 모든 것을 짓밟았습니다. 평판이 바뀐 게 아니라, 모든 것이 죽어버렸소. 그래서... 바로잡아야만 했지.",
      "lie_behavior": "처음으로 감정을 드러내며, '사랑'이라는 단어에 냉소적으로 반응하며 분노를 표출하고, 자신의 범행을 정당화하는 듯한 말을 무심코 흘린다."
    },
    {
      "id": "QA_key_possession",
      "keywords": ["보관창고 열쇠", "항상"],
      "fact_innocent": "네, 창고 열쇠는 항상 제가 소지하고 있습니다. 그게 규칙입니다.",
      "fact_killer": "물론입니다. 제가 관리하죠. (스스로 '칼이 사라졌다'는 의심 포인트와 모순되는 진술을 함)",
      "lie_behavior": "자신이 모든 것을 통제한다는 것을 과시하려다, 이전에 했던 거짓말('열쇠를 잠시 잃어버렸다')과 모순되는 말을 자신도 모르게 내뱉는다. 탐정이 이 모순을 지적하면 당황하며 화를 낸다."
    },
    {
      "id": "QA_justification",
      "keywords": ["지키기 위해", "막아야 했다", "정당"],
      "fact_innocent": "어떤 상황이든 폭력은 정당화될 수 없습니다. 모든 문제는 절차에 따라 해결해야 합니다.",
      "fact_killer": "이 역은 아직 살아 있습니다. 살아있는 것을 억지로 죽이려는 자가 있다면, 그것을 막는 것은... 필요한 일일 수 있습니다.",
      "lie_behavior": "살인이 아닌, '역을 지키는 행위'로 자신의 범행을 미화하고 정당화하려는 철학적인 답변을 한다."
    }
  ]
}