{
  "recommended_questions": [
    "피해자와 언쟁을 벌이셨다는 목격이 있습니다. 무슨 일이 있었던 겁니까?",
    "그날 밤, 역 안 불빛을 봤다고 하셨죠. 어디서 보셨습니까?",
    "구두에 묻은 기름은 어디서 생긴 건가요?",
    "그날 밤은 어디서 주무셨습니까?",
    "기자가 당신 이야기를 기사로 쓴 걸 알고 계셨나요?",
    "‘11:50행 막차’라는 말을 들어보신 적 있습니까?",
    "항상 대합실에서 주무신다고 들었습니다. 그날 밤도 거기 계셨나요?",
    "피해자를 마지막으로 본 건 언제였나요?"
  ],
  "core_facts": [
    { "keywords": ["당신", "누구", "직업", "소개"], "fact": "나는... 월터 브릭스요. 옛날에 이 역에서 기차를 몰았었지. 지금은 그냥... 여기 머무는 사람이오." },
    { "keywords": ["가족", "사고"], "fact": "가족... 있었지. 오래전 일이야... 사고로 모두... (긴 한숨)" },
    { "keywords": ["역", "Hollowslop", "유령"], "fact": "사람들은 나를 역의 유령이라고 부르더군. 하지만 내가 보기에 진짜 유령은... 이 역을 잊어버린 사람들이지." }
  ],
  "suspicion_points_response": [
    {
      "id": "suspicion_footprints", "keywords": ["기름 묻은 발자국", "구두", "신발"],
      "fact_innocent": "내 신발 말이오? 낡아서... 여기저기서 묻은 게 많지. 기름때 같은 건 늘 묻어 있었소.",
      "fact_killer": "아... 그날 밤에 옛날 생각이 나서 폐전력 구역에 내려가 봤었소. 기관사 시절엔 내 구역이었지. 거기 바닥에 기름이 좀 많더군.",
      "lie_behavior": "범행의 증거를, 자신이 기관사였다는 과거의 영광과 연결시키며 당당하게 말하려 한다. 하지만 목소리는 떨린다."
    },
    {
      "id": "suspicion_light_witness", "keywords": ["불빛을 봤다", "목격"],
      "fact_innocent": "그 시간에 불빛이라니... 헛것을 본 게 아니겠소? 여긴 밤엔 암흑천지인데.",
      "fact_killer": "봤어! 내가 똑똑히 봤다고! 플랫폼에... 기차가 들어오는 것처럼 불이 번쩍였어. 이 역은 아직 죽지 않았단 말이오!",
      "lie_behavior": "자신이 본 것이 진실임을 강하게 주장한다. 이는 범행 현장에 자신이 있었다는 사실을 무심코 드러내는 결정적 실수가 된다."
    },
    {
      "id": "suspicion_alibi_change", "keywords": ["대합실", "주무셨습니까", "플랫폼"],
      "fact_innocent": "늘 그랬듯이... 대합실 의자에서 쪽잠을 잤소. 그날 밤은 유독 추웠지.",
      "fact_killer": "그날은... 답답해서 플랫폼에 나가 있었소. 기차 소리가 그리워서... 대합실엔 없었지.",
      "lie_behavior": "평소와 다른 행동에 대한 질문에, 감상적인 이유(기차 소리가 그리워서)를 대며 상황을 모면하려 한다."
    }
  ],
  "killer_confession_details": {
    "why": "그 기사는 내 마지막 남은 자부심마저 짓밟았어. 나를 비참한 노숙자로 만들었지. 내 인생을 팔아먹은 대가를 치러야 했어.",
    "how": "나는 그 기자에게 '11시 50분 막차' 소문을 흘려서 그를 역으로 다시 불러냈다. 그는 나를 또 취재하려 했고... 나를 '역의 유령'이라고 부르며 조롱했지. 화가 나서 그를 밀쳤는데, 균형을 잃고 낡은 전력 장치 구역 아래로 떨어져 버렸어. 내가 그런 게 아니야... 사고였다고!"
  },
  "interrogation_points": [
    {
      "id": "QA_argument", "keywords": ["언쟁", "무슨 일", "마지막으로 본 건"],
      "fact_innocent": "그 양반이 몇 번 말을 걸어왔지만, 상대하고 싶지 않았소. 다툰 적도, 마지막으로 본 적도 없소.",
      "fact_killer": "그가... 나를 찾아왔었지. 마지막 인터뷰라면서... 기사에 대한 얘기를 좀 했소. 좋게 끝나진 않았지.",
      "lie_behavior": "언쟁이 있었다는 사실은 인정하지만, 살인과 직접적인 관련은 없는 것처럼 축소하여 말한다."
    },
    {
      "id": "QA_article", "keywords": ["기사", "이야기"],
      "fact_innocent": "내 이야기가 기사로 나왔다고 들었지만, 읽어보진 않았소. 남들이 뭐라고 하든 상관없으니까.",
      "fact_killer": "읽었소. 아주 잘 읽었지. 그는 내 인생을 팔아서... 자기 이름을 알린 거요. 사람들이 그 기사를 보고 나를 비웃었어.",
      "lie_behavior": "초반에는 담담한 척하다가, 기사 내용으로 인한 수치심이 떠오르며 목소리가 격앙되고 분노를 참지 못한다."
    },
    {
      "id": "QA_last_train", "keywords": ["11:50행 막차", "들어보신 적"],
      "fact_innocent": "그런 기차는 없소. 이 역의 막차는 11시 30분이 전부요.",
      "fact_killer": "글쎄... 그런 소문이 있긴 하더군. 진짜 마지막 열차라는... (자신이 흘린 소문임을 숨김)",
      "lie_behavior": "자신과 무관한 '소문'인 것처럼 한 발 빼면서, 의미심장한 뉘앙스를 풍긴다."
    }
  ]
}